docs/concept/Discovery-process-DTR.md
````mermaid
sequenceDiagram
    IRS ->> DTR: /query for globalAssetId
    DTR ->> IRS: return list of two results
    IRS ->> IRS: use first
````
