docs/concept/Discovery-process-DTR.md
````mermaid
sequenceDiagram
    IRS ->> Discovery Service: Get EDCs for BPN
    Discovery Service ->> IRS: Return list of 1 EDC
    IRS ->> EDC Provider: Query for DTR contract offer
    EDC Provider ->> IRS: 2 DTR contract offers
    par Query DTR 1
        IRS ->> EDC Provider: Negotiate contract
        IRS ->> DTR 1: Query for DT
        DTR 1 ->> IRS: no DT
    and Query DTR 2
        IRS ->> EDC Provider: Negotiate contract
        IRS ->> DTR 2: Query for DT
        DTR 2 ->> IRS: DT
    end
````
