docs/concept/Discovery-process-DTR.md
````mermaid
sequenceDiagram
    IRS ->> Discovery Service: Get EDCs for BPN
    Discovery Service ->> IRS: Return list of 1 EDC
    IRS ->> EDC Provider 3: Query for DTR contract offer
    EDC Provider 3 ->> IRS: DTR contract offer
    IRS -> EDC Provider 3: Negotiate contract
    IRS ->> DTR: Query for DT
    DTR ->> IRS: DT
````
