docs/concept/Discovery-process-DTR.md
````mermaid
sequenceDiagram
    IRS ->> Discovery Service: Get EDCs for BPN
    Discovery Service ->> IRS: Return list of 3 EDCs
    par Catalog Request to EDC 1
        IRS ->> EDC Provider 1: Query for DTR contract offer
        EDC Provider 1 ->> IRS: No offer
    and Catalog Request to EDC 2
        IRS ->> EDC Provider 2: Query for DTR contract offer
        EDC Provider 2 ->> IRS: No offer
    and Catalog Request to EDC 3
        IRS ->> EDC Provider 3: Query for DTR contract offer
        EDC Provider 3 ->> IRS: No offer
    end
    IRS ->> IRS: Tombstone
````
